#Задание 1
#Дан текстовый файл. Необходимо создать новый файл, убрав из него все неприемлемые слова.
#Список неприемлимых слов находится в другом файле.
#1)

#Задание 2
#Написать программу транслитерации с русского на английский и наоборот.
#Данные для тренслитерации берутся из файла и записываются в другой файл.
#Направление перевода определяется через меню пользователя.
#2)

#Задание 3
#Пользователь с клавитатуры вводит названия файлов, до тех пор, пока он не введет слово quit.
#После завершения ввода программа должна объединить содержимое всех перечисленных пользователем файлов в один.
#3)

#Задание 4
#Пользователь с клавиатуры вводит названия файлов, до тех пор, пока он не введет слово quit.
#После завершения ввода программа должна записать в итоговый файл символы, которые есть во всех перечмсленных файлах
#(символы должны быть в каждом файле).
#4)